HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC65 */
#define IFX_ERAY_MBSC3_MBC65_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC65 */
#define IFX_ERAY_MBSC3_MBC65_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC65 */
#define IFX_ERAY_MBSC3_MBC65_OFF (1)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC66 */
#define IFX_ERAY_MBSC3_MBC66_OFF (2)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC67 */
#define IFX_ERAY_MBSC3_MBC67_OFF (3)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC68 */
#define IFX_ERAY_MBSC3_MBC68_OFF (4)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC69 */
#define IFX_ERAY_MBSC3_MBC69_OFF (5)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC70 */
#define IFX_ERAY_MBSC3_MBC70_OFF (6)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC71 */
#define IFX_ERAY_MBSC3_MBC71_OFF (7)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC72 */
#define IFX_ERAY_MBSC3_MBC72_OFF (8)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC73 */
#define IFX_ERAY_MBSC3_MBC73_OFF (9)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC74 */
#define IFX_ERAY_MBSC3_MBC74_OFF (10)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC75 */
#define IFX_ERAY_MBSC3_MBC75_OFF (11)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC76 */
#define IFX_ERAY_MBSC3_MBC76_OFF (12)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC77 */
#define IFX_ERAY_MBSC3_MBC77_OFF (13)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC78 */
#define IFX_ERAY_MBSC3_MBC78_OFF (14)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC79 */
#define IFX_ERAY_MBSC3_MBC79_OFF (15)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC80 */
#define IFX_ERAY_MBSC3_MBC80_OFF (16)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC81 */
#define IFX_ERAY_MBSC3_MBC81_OFF (17)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC82 */
#define IFX_ERAY_MBSC3_MBC82_OFF (18)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC83 */
#define IFX_ERAY_MBSC3_MBC83_OFF (19)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC84 */
#define IFX_ERAY_MBSC3_MBC84_OFF (20)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC85 */
#define IFX_ERAY_MBSC3_MBC85_OFF (21)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC86 */
#define IFX_ERAY_MBSC3_MBC86_OFF (22)

/** \\brief  Length for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC87 */
#define IFX_ERAY_MBSC3_MBC87_OFF (23)

