HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_OFF (18)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_OFF (19)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_OFF (20)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC117 */
#define IFX_ERAY_MBSC4_MBC117_OFF (21)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC118 */
#define IFX_ERAY_MBSC4_MBC118_OFF (22)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC119 */
#define IFX_ERAY_MBSC4_MBC119_OFF (23)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC120 */
#define IFX_ERAY_MBSC4_MBC120_OFF (24)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC121 */
#define IFX_ERAY_MBSC4_MBC121_OFF (25)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC122 */
#define IFX_ERAY_MBSC4_MBC122_OFF (26)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC123 */
#define IFX_ERAY_MBSC4_MBC123_OFF (27)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC124 */
#define IFX_ERAY_MBSC4_MBC124_OFF (28)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC125 */
#define IFX_ERAY_MBSC4_MBC125_OFF (29)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC126 */
#define IFX_ERAY_MBSC4_MBC126_OFF (30)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC127 */
#define IFX_ERAY_MBSC4_MBC127_OFF (31)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC96 */
#define IFX_ERAY_MBSC4_MBC96_OFF (0)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC97 */
#define IFX_ERAY_MBSC4_MBC97_OFF (1)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC98 */
#define IFX_ERAY_MBSC4_MBC98_OFF (2)

/** \\brief  Length for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC99 */
#define IFX_ERAY_MBSC4_MBC99_OFF (3)

/** \\brief  Length for Ifx_ERAY_MHDC_Bits.SFDL */
#define IFX_ERAY_MHDC_SFDL_LEN (7)

/** \\brief  Mask for Ifx_ERAY_MHDC_Bits.SFDL */
#define IFX_ERAY_MHDC_SFDL_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_MHDC_Bits.SFDL */
#define IFX_ERAY_MHDC_SFDL_OFF (0)

/** \\brief  Length for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_LEN (13)

/** \\brief  Mask for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_MSK (0x1fff)

/** \\brief  Offset for Ifx_ERAY_MHDC_Bits.SLT */
#define IFX_ERAY_MHDC_SLT_OFF (16)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.FNFA */
#define IFX_ERAY_MHDF_FNFA_OFF (2)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MHDF_Bits.FNFB */
#define IFX_ERAY_MHDF_FNFB_OFF (3)

/** \\brief  Length for Ifx_ERAY_MHDF_Bits.SNUA */
#define IFX_ERAY_MHDF_SNUA_LEN (1)

