HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_OFF (2)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_OFF (30)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_OFF (31)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_OFF (3)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_OFF (4)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_OFF (5)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP6 */
#define IFX_ERAY_MSIC1_MSIP6_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP6 */
#define IFX_ERAY_MSIC1_MSIP6_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP6 */
#define IFX_ERAY_MSIC1_MSIP6_OFF (6)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP7 */
#define IFX_ERAY_MSIC1_MSIP7_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP7 */
#define IFX_ERAY_MSIC1_MSIP7_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP7 */
#define IFX_ERAY_MSIC1_MSIP7_OFF (7)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP8 */
#define IFX_ERAY_MSIC1_MSIP8_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP8 */
#define IFX_ERAY_MSIC1_MSIP8_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP8 */
#define IFX_ERAY_MSIC1_MSIP8_OFF (8)

/** \\brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP9 */
#define IFX_ERAY_MSIC1_MSIP9_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP9 */
#define IFX_ERAY_MSIC1_MSIP9_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP9 */
#define IFX_ERAY_MSIC1_MSIP9_OFF (9)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP32 */
#define IFX_ERAY_MSIC2_MSIP32_OFF (0)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP33 */
#define IFX_ERAY_MSIC2_MSIP33_OFF (1)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP34 */
#define IFX_ERAY_MSIC2_MSIP34_OFF (2)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP35 */
#define IFX_ERAY_MSIC2_MSIP35_OFF (3)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP36 */
#define IFX_ERAY_MSIC2_MSIP36_OFF (4)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP37 */
#define IFX_ERAY_MSIC2_MSIP37_OFF (5)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP38 */
#define IFX_ERAY_MSIC2_MSIP38_OFF (6)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP39 */
#define IFX_ERAY_MSIC2_MSIP39_OFF (7)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP40 */
#define IFX_ERAY_MSIC2_MSIP40_OFF (8)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP41 */
#define IFX_ERAY_MSIC2_MSIP41_OFF (9)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP42 */
#define IFX_ERAY_MSIC2_MSIP42_OFF (10)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP43 */
#define IFX_ERAY_MSIC2_MSIP43_OFF (11)

/** \\brief  Length for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC2_Bits.MSIP44 */
#define IFX_ERAY_MSIC2_MSIP44_OFF (12)

