HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP115 */
#define IFX_ERAY_MSIC4_MSIP115_OFF (19)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP116 */
#define IFX_ERAY_MSIC4_MSIP116_OFF (20)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP117 */
#define IFX_ERAY_MSIC4_MSIP117_OFF (21)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP118 */
#define IFX_ERAY_MSIC4_MSIP118_OFF (22)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_OFF (23)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_OFF (24)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_OFF (25)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_OFF (26)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_OFF (27)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_OFF (28)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_OFF (29)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_OFF (30)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_OFF (31)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_OFF (0)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_OFF (1)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_OFF (2)

/** \\brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_LEN (1)

/** \\brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_OFF (3)

/** \\brief  Length for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_LEN (6)

/** \\brief  Mask for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_OFF (16)

/** \\brief  Length for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_LEN (14)

/** \\brief  Mask for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_MSK (0x1)

