HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND125 */
#define IFX_ERAY_NDAT4_ND125_OFF (29)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND126 */
#define IFX_ERAY_NDAT4_ND126_OFF (30)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND127 */
#define IFX_ERAY_NDAT4_ND127_OFF (31)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_OFF (2)

/** \\brief  Length for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_OFF (3)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP0 */
#define IFX_ERAY_NDIC1_NDIP0_OFF (0)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP10 */
#define IFX_ERAY_NDIC1_NDIP10_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP11 */
#define IFX_ERAY_NDIC1_NDIP11_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP12 */
#define IFX_ERAY_NDIC1_NDIP12_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP13 */
#define IFX_ERAY_NDIC1_NDIP13_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP14 */
#define IFX_ERAY_NDIC1_NDIP14_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP15 */
#define IFX_ERAY_NDIC1_NDIP15_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP16 */
#define IFX_ERAY_NDIC1_NDIP16_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP17 */
#define IFX_ERAY_NDIC1_NDIP17_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP18 */
#define IFX_ERAY_NDIC1_NDIP18_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP19 */
#define IFX_ERAY_NDIC1_NDIP19_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP1 */
#define IFX_ERAY_NDIC1_NDIP1_OFF (1)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP20 */
#define IFX_ERAY_NDIC1_NDIP20_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP21 */
#define IFX_ERAY_NDIC1_NDIP21_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC1_Bits.NDIP22 */
#define IFX_ERAY_NDIC1_NDIP22_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC1_Bits.NDIP23 */
#define IFX_ERAY_NDIC1_NDIP23_MSK (0x1)

