HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP39 */
#define IFX_ERAY_NDIC2_NDIP39_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP39 */
#define IFX_ERAY_NDIC2_NDIP39_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP39 */
#define IFX_ERAY_NDIC2_NDIP39_OFF (7)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP40 */
#define IFX_ERAY_NDIC2_NDIP40_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP40 */
#define IFX_ERAY_NDIC2_NDIP40_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP40 */
#define IFX_ERAY_NDIC2_NDIP40_OFF (8)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP41 */
#define IFX_ERAY_NDIC2_NDIP41_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP41 */
#define IFX_ERAY_NDIC2_NDIP41_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP41 */
#define IFX_ERAY_NDIC2_NDIP41_OFF (9)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP42 */
#define IFX_ERAY_NDIC2_NDIP42_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP42 */
#define IFX_ERAY_NDIC2_NDIP42_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP42 */
#define IFX_ERAY_NDIC2_NDIP42_OFF (10)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP43 */
#define IFX_ERAY_NDIC2_NDIP43_OFF (11)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP44 */
#define IFX_ERAY_NDIC2_NDIP44_OFF (12)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP45 */
#define IFX_ERAY_NDIC2_NDIP45_OFF (13)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP46 */
#define IFX_ERAY_NDIC2_NDIP46_OFF (14)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP47 */
#define IFX_ERAY_NDIC2_NDIP47_OFF (15)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP48 */
#define IFX_ERAY_NDIC2_NDIP48_OFF (16)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP49 */
#define IFX_ERAY_NDIC2_NDIP49_OFF (17)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP50 */
#define IFX_ERAY_NDIC2_NDIP50_OFF (18)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP51 */
#define IFX_ERAY_NDIC2_NDIP51_OFF (19)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP52 */
#define IFX_ERAY_NDIC2_NDIP52_OFF (20)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP53 */
#define IFX_ERAY_NDIC2_NDIP53_OFF (21)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP54 */
#define IFX_ERAY_NDIC2_NDIP54_OFF (22)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP55 */
#define IFX_ERAY_NDIC2_NDIP55_OFF (23)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP56 */
#define IFX_ERAY_NDIC2_NDIP56_OFF (24)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP57 */
#define IFX_ERAY_NDIC2_NDIP57_OFF (25)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP58 */
#define IFX_ERAY_NDIC2_NDIP58_OFF (26)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_NDIC2_Bits.NDIP59 */
#define IFX_ERAY_NDIC2_NDIP59_OFF (27)

/** \\brief  Length for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_LEN (1)

/** \\brief  Mask for Ifx_ERAY_NDIC2_Bits.NDIP60 */
#define IFX_ERAY_NDIC2_NDIP60_MSK (0x1)

