HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_OFF (0)

/** \\brief  Length for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_LEN (7)

/** \\brief  Mask for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_OFF (16)

/** \\brief  Length for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_LEN (7)

/** \\brief  Mask for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_OFF (24)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_LEN (11)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_OFF (0)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_OFF (27)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_OFF (28)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_LEN (6)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.RCC */
#define IFX_ERAY_RDHS3_RCC_OFF (16)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.RCI */
#define IFX_ERAY_RDHS3_RCI_OFF (24)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.RES */
#define IFX_ERAY_RDHS3_RES_OFF (29)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.SFI */
#define IFX_ERAY_RDHS3_SFI_OFF (25)

/** \\brief  Length for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_LEN (1)

/** \\brief  Mask for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_RDHS3_Bits.SYN */
#define IFX_ERAY_RDHS3_SYN_OFF (26)

/** \\brief  Length for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_LEN (11)

/** \\brief  Mask for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_SCV_Bits.SCCA */
#define IFX_ERAY_SCV_SCCA_OFF (0)

/** \\brief  Length for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_LEN (11)

/** \\brief  Mask for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_SCV_Bits.SCCB */
#define IFX_ERAY_SCV_SCCB_OFF (16)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.MOCS */
#define IFX_ERAY_SFS_MOCS_OFF (16)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.MRCS */
#define IFX_ERAY_SFS_MRCS_OFF (18)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.OCLR */
#define IFX_ERAY_SFS_OCLR_OFF (17)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.RCLR */
#define IFX_ERAY_SFS_RCLR_OFF (19)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.VSAE */
#define IFX_ERAY_SFS_VSAE_OFF (0)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.VSAO */
#define IFX_ERAY_SFS_VSAO_OFF (4)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.VSBE */
#define IFX_ERAY_SFS_VSBE_OFF (8)

/** \\brief  Length for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SFS_Bits.VSBO */
#define IFX_ERAY_SFS_VSBO_OFF (12)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.CASE */
#define IFX_ERAY_SIER_CASE_OFF (1)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.CYCSE */
#define IFX_ERAY_SIER_CYCSE_OFF (2)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIER_Bits.MBSIE */
#define IFX_ERAY_SIER_MBSIE_OFF (14)

/** \\brief  Length for Ifx_ERAY_SIER_Bits.MTSAE */
#define IFX_ERAY_SIER_MTSAE_LEN (1)

