HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Length for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.RFCLE */
#define IFX_ERAY_SIES_RFCLE_OFF (6)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.RFNEE */
#define IFX_ERAY_SIES_RFNEE_OFF (5)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.RXIE */
#define IFX_ERAY_SIES_RXIE_OFF (4)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.SDSE */
#define IFX_ERAY_SIES_SDSE_OFF (15)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.SUCSE */
#define IFX_ERAY_SIES_SUCSE_OFF (13)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.SWEE */
#define IFX_ERAY_SIES_SWEE_OFF (12)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.TI0E */
#define IFX_ERAY_SIES_TI0E_OFF (8)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.TI1E */
#define IFX_ERAY_SIES_TI1E_OFF (9)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.TIBCE */
#define IFX_ERAY_SIES_TIBCE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.TIBCE */
#define IFX_ERAY_SIES_TIBCE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.TIBCE */
#define IFX_ERAY_SIES_TIBCE_OFF (10)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.TOBCE */
#define IFX_ERAY_SIES_TOBCE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.TOBCE */
#define IFX_ERAY_SIES_TOBCE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.TOBCE */
#define IFX_ERAY_SIES_TOBCE_OFF (11)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.TXIE */
#define IFX_ERAY_SIES_TXIE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.TXIE */
#define IFX_ERAY_SIES_TXIE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.TXIE */
#define IFX_ERAY_SIES_TXIE_OFF (3)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.WSTE */
#define IFX_ERAY_SIES_WSTE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.WSTE */
#define IFX_ERAY_SIES_WSTE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.WSTE */
#define IFX_ERAY_SIES_WSTE_OFF (0)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.WUPAE */
#define IFX_ERAY_SIES_WUPAE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.WUPAE */
#define IFX_ERAY_SIES_WUPAE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.WUPAE */
#define IFX_ERAY_SIES_WUPAE_OFF (16)

/** \\brief  Length for Ifx_ERAY_SIES_Bits.WUPBE */
#define IFX_ERAY_SIES_WUPBE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIES_Bits.WUPBE */
#define IFX_ERAY_SIES_WUPBE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIES_Bits.WUPBE */
#define IFX_ERAY_SIES_WUPBE_OFF (24)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.CASL */
#define IFX_ERAY_SILS_CASL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.CASL */
#define IFX_ERAY_SILS_CASL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.CASL */
#define IFX_ERAY_SILS_CASL_OFF (1)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.CYCSL */
#define IFX_ERAY_SILS_CYCSL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.CYCSL */
#define IFX_ERAY_SILS_CYCSL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.CYCSL */
#define IFX_ERAY_SILS_CYCSL_OFF (2)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.MBSIL */
#define IFX_ERAY_SILS_MBSIL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.MBSIL */
#define IFX_ERAY_SILS_MBSIL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.MBSIL */
#define IFX_ERAY_SILS_MBSIL_OFF (14)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.MTSAL */
#define IFX_ERAY_SILS_MTSAL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.MTSAL */
#define IFX_ERAY_SILS_MTSAL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.MTSAL */
#define IFX_ERAY_SILS_MTSAL_OFF (17)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.MTSBL */
#define IFX_ERAY_SILS_MTSBL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.MTSBL */
#define IFX_ERAY_SILS_MTSBL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.MTSBL */
#define IFX_ERAY_SILS_MTSBL_OFF (25)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.NMVCL */
#define IFX_ERAY_SILS_NMVCL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.NMVCL */
#define IFX_ERAY_SILS_NMVCL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.NMVCL */
#define IFX_ERAY_SILS_NMVCL_OFF (7)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.RFCLL */
#define IFX_ERAY_SILS_RFCLL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.RFCLL */
#define IFX_ERAY_SILS_RFCLL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.RFCLL */
#define IFX_ERAY_SILS_RFCLL_OFF (6)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.RFNEL */
#define IFX_ERAY_SILS_RFNEL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.RFNEL */
#define IFX_ERAY_SILS_RFNEL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.RFNEL */
#define IFX_ERAY_SILS_RFNEL_OFF (5)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.RXIL */
#define IFX_ERAY_SILS_RXIL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.RXIL */
#define IFX_ERAY_SILS_RXIL_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SILS_Bits.RXIL */
#define IFX_ERAY_SILS_RXIL_OFF (4)

/** \\brief  Length for Ifx_ERAY_SILS_Bits.SDSL */
#define IFX_ERAY_SILS_SDSL_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SILS_Bits.SDSL */
#define IFX_ERAY_SILS_SDSL_MSK (0x1)

