HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TI1 */
#define IFX_ERAY_SIR_TI1_OFF (9)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TIBC */
#define IFX_ERAY_SIR_TIBC_OFF (10)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TOBC */
#define IFX_ERAY_SIR_TOBC_OFF (11)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.TXI */
#define IFX_ERAY_SIR_TXI_OFF (3)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.WST */
#define IFX_ERAY_SIR_WST_OFF (0)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.WUPA */
#define IFX_ERAY_SIR_WUPA_OFF (16)

/** \\brief  Length for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SIR_Bits.WUPB */
#define IFX_ERAY_SIR_WUPB_OFF (24)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.EDGE */
#define IFX_ERAY_STPW1_EDGE_OFF (2)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_LEN (1)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.EETP */
#define IFX_ERAY_STPW1_EETP_OFF (4)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_LEN (1)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.EINT0 */
#define IFX_ERAY_STPW1_EINT0_OFF (5)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.EINT1 */
#define IFX_ERAY_STPW1_EINT1_OFF (6)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_LEN (1)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.ESWT */
#define IFX_ERAY_STPW1_ESWT_OFF (0)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_LEN (6)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_MSK (0x3f)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.SCCV */
#define IFX_ERAY_STPW1_SCCV_OFF (8)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_LEN (14)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.SMTV */
#define IFX_ERAY_STPW1_SMTV_OFF (16)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_LEN (1)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.SSWT */
#define IFX_ERAY_STPW1_SSWT_OFF (3)

/** \\brief  Length for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_STPW1_Bits.SWMS */
#define IFX_ERAY_STPW1_SWMS_OFF (1)

/** \\brief  Length for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_LEN (11)

/** \\brief  Mask for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_STPW2_Bits.SSCVA */
#define IFX_ERAY_STPW2_SSCVA_OFF (0)

/** \\brief  Length for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_LEN (11)

/** \\brief  Mask for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_MSK (0x7ff)

/** \\brief  Offset for Ifx_ERAY_STPW2_Bits.SSCVB */
#define IFX_ERAY_STPW2_SSCVB_OFF (16)

/** \\brief  Length for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SUCC1_Bits.CCHA */
#define IFX_ERAY_SUCC1_CCHA_OFF (26)

/** \\brief  Length for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SUCC1_Bits.CCHB */
#define IFX_ERAY_SUCC1_CCHB_OFF (27)

/** \\brief  Length for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_LEN (4)

/** \\brief  Mask for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_SUCC1_Bits.CMD */
#define IFX_ERAY_SUCC1_CMD_OFF (0)

/** \\brief  Length for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_LEN (5)

/** \\brief  Mask for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_MSK (0x1f)

/** \\brief  Offset for Ifx_ERAY_SUCC1_Bits.CSA */
#define IFX_ERAY_SUCC1_CSA_OFF (11)

/** \\brief  Length for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SUCC1_Bits.HCSE */
#define IFX_ERAY_SUCC1_HCSE_OFF (23)

/** \\brief  Length for Ifx_ERAY_SUCC1_Bits.MTSA */
#define IFX_ERAY_SUCC1_MTSA_LEN (1)

