HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_SWNIT_Bits.TCSB */
#define IFX_ERAY_SWNIT_TCSB_OFF (5)

/** \\brief  Length for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_LEN (7)

/** \\brief  Mask for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_MSK (0x7f)

/** \\brief  Offset for Ifx_ERAY_T0C_Bits.T0CC */
#define IFX_ERAY_T0C_T0CC_OFF (8)

/** \\brief  Length for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_LEN (14)

/** \\brief  Mask for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_T0C_Bits.T0MO */
#define IFX_ERAY_T0C_T0MO_OFF (16)

/** \\brief  Length for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_T0C_Bits.T0MS */
#define IFX_ERAY_T0C_T0MS_OFF (1)

/** \\brief  Length for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_T0C_Bits.T0RC */
#define IFX_ERAY_T0C_T0RC_OFF (0)

/** \\brief  Length for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_LEN (14)

/** \\brief  Mask for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_MSK (0x3fff)

/** \\brief  Offset for Ifx_ERAY_T1C_Bits.T1MC */
#define IFX_ERAY_T1C_T1MC_OFF (16)

/** \\brief  Length for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_LEN (1)

/** \\brief  Mask for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_T1C_Bits.T1MS */
#define IFX_ERAY_T1C_T1MS_OFF (1)

/** \\brief  Length for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_T1C_Bits.T1RC */
#define IFX_ERAY_T1C_T1RC_OFF (0)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.AOA */
#define IFX_ERAY_TEST1_AOA_OFF (8)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.AOB */
#define IFX_ERAY_TEST1_AOB_OFF (9)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_LEN (4)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.CERA */
#define IFX_ERAY_TEST1_CERA_OFF (24)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_LEN (4)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_MSK (0xf)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.CERB */
#define IFX_ERAY_TEST1_CERB_OFF (28)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_OFF (1)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.RXA */
#define IFX_ERAY_TEST1_RXA_OFF (16)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.RXB */
#define IFX_ERAY_TEST1_RXB_OFF (17)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_LEN (2)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_MSK (0x3)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TMC */
#define IFX_ERAY_TEST1_TMC_OFF (4)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TXA */
#define IFX_ERAY_TEST1_TXA_OFF (18)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TXB */
#define IFX_ERAY_TEST1_TXB_OFF (19)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TXENA */
#define IFX_ERAY_TEST1_TXENA_OFF (20)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_OFF (21)

/** \\brief  Length for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_OFF (0)

/** \\brief  Length for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_LEN (3)

/** \\brief  Mask for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_MSK (0x7)

/** \\brief  Offset for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_OFF (0)

/** \\brief  Length for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_LEN (3)

/** \\brief  Mask for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_MSK (0x7)

/** \\brief  Offset for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_OFF (4)

/** \\brief  Length for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_OFF (14)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_LEN (1)

