HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEray_bf.h
/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_OFF (0)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_OFF (10)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_OFF (11)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_OFF (12)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_OFF (13)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_OFF (14)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_OFF (15)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_OFF (16)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_OFF (17)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_OFF (18)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_OFF (19)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_OFF (1)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_OFF (20)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_OFF (21)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_OFF (22)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_OFF (23)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_OFF (24)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_OFF (25)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_OFF (26)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR27 */
#define IFX_ERAY_TXRQ1_TXR27_OFF (27)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR28 */
#define IFX_ERAY_TXRQ1_TXR28_OFF (28)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR29 */
#define IFX_ERAY_TXRQ1_TXR29_OFF (29)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR2 */
#define IFX_ERAY_TXRQ1_TXR2_OFF (2)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR30 */
#define IFX_ERAY_TXRQ1_TXR30_OFF (30)

/** \\brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_LEN (1)

/** \\brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_MSK (0x1)

/** \\brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR31 */
#define IFX_ERAY_TXRQ1_TXR31_OFF (31)

